docs/finance/option.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-07 Sun 23:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<meta  name="keywords" content="option" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline22">1. Option</a>
<ul>
<li><a href="#orgheadline1">1.1. definition</a></li>
<li><a href="#orgheadline2">1.2. Option premium:</a></li>
<li><a href="#orgheadline11">1.3. Black Scholes vs Monte Carlo vs Binomial tree</a></li>
<li><a href="#orgheadline17">1.4. Greeks</a></li>
<li><a href="#orgheadline18">1.5. Market microstructure and products</a></li>
<li><a href="#orgheadline19">1.6. Basics of vanilla option risk</a></li>
<li><a href="#orgheadline20">1.7. Risks of exotic options</a></li>
<li><a href="#orgheadline21">1.8. Option theory</a></li>
</ul>
</li>
<li><a href="#orgheadline23">2. Future</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">1</span> Option</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> definition</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>call: right to purchase stocks at strike price.</li>
<li>put: right to sell stocks at strike price.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Option premium:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>premium = intrinsic value + time value
<ol class="org-ol">
<li>Intrinsic value in options is the in-the-money portion of the option's premium. For example, if a call options strike price is $15 and the underlying stock's market price is at $25, then the intrinsic value of the call option is $10, or $25 - $15.</li>
<li>Value of a call option: max[(S-K),0].</li>
<li>Value of a put option: max[(K-S),0].</li>
<li>the time value (TV) (extrinsic or instrumental value) of an option is the premium a rational investor would pay over its current exercise value (intrinsic value), based on the probability it will increase in value before expiry.</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.3</span> Black Scholes vs Monte Carlo vs Binomial tree</h3>
<div class="outline-text-3" id="text-1-3">
</div><ol class="org-ol"><li><a id="orgheadline6"></a>Black Scholes:<br  /><div class="outline-text-4" id="text-1-3-1">
<p>
known input factors such as time to expiration, volatility, interest rate, current stock price, strike price, dividend yield. It's based on risk neutral process under some reasonable assumptions.
</p>
<ul class="org-ul">
<li>the underlying stock price follows a geometric Brownian motion</li>
<li>The model is based on a normal distribution of underlying asset returns</li>
<li>The option is European and can only be exercised at expiration</li>
<li>No dividends are paid out during the life of the option</li>
<li>Efficient markets (i.e., market movements cannot be predicted)</li>
<li>There are no transaction costs in buying the option</li>
<li>The risk-free rate and volatility of the underlying are known and constant</li>
<li>That the returns on the underlying are normally distributed</li>
</ul>
</div>

<ul class="org-ul"><li><a id="orgheadline5"></a>Advantages &amp; Limitations<br  /><ul class="org-ul"><li><a id="orgheadline3"></a>Advantage: The main advantage of the Black-Scholes model is speed &#x2013; it lets you calculate a very large number of option prices in a very short time.<br  /></li>

<li><a id="orgheadline4"></a>Limitation: The Black-Scholes model has one major limitation:  it cannot be used to accurately price options with an American-style exercise as it only calculates the option price at one point in time &#x2013;  at expiration. It does not consider the steps along the way where there could be the possibility of early exercise of an American option.<br  /></li></ul></li></ul></li>
<li><a id="orgheadline10"></a>Monte Carlo and binomial tree use numerical simulation procedures.<br  /><ul class="org-ul"><li><a id="orgheadline9"></a>Advantages &amp; Limitations<br  /><ul class="org-ul"><li><a id="orgheadline7"></a>Advantage: The big advantage the binomial model has over the Black-Scholes model is that it can be used to accurately price American options.<br  /></li>
<li><a id="orgheadline8"></a>Limitation:  The main limitation of the binomial model is its relatively slow speed.<br  /></li></ul></li></ul></li></ol>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">1.4</span> Greeks</h3>
<div class="outline-text-3" id="text-1-4">
</div><ol class="org-ol"><li><a id="orgheadline12"></a>delta<br  /><div class="outline-text-4" id="text-1-4-1">
<p>
Option value change respected to the stock price change.
</p>
</div></li>

<li><a id="orgheadline13"></a>gamma<br  /><div class="outline-text-4" id="text-1-4-2">
<p>
Option delta change respected to the stock price change.
</p>
</div></li>

<li><a id="orgheadline14"></a>theta<br  /><div class="outline-text-4" id="text-1-4-3">
<p>
Option value change respected to the time to expiration.
</p>
</div></li>

<li><a id="orgheadline15"></a>rho<br  /><div class="outline-text-4" id="text-1-4-4">
<p>
Option value change respected to the interest rate change.
</p>
</div></li>

<li><a id="orgheadline16"></a>vega<br  /><div class="outline-text-4" id="text-1-4-5">
<p>
Option value change respected to the volatility change.
</p>
</div></li></ol>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">1.5</span> Market microstructure and products</h3>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">1.6</span> Basics of vanilla option risk</h3>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">1.7</span> Risks of exotic options</h3>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">1.8</span> Option theory</h3>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">2</span> Future</h2>
<div class="outline-text-2" id="text-2">
<p>
*基差=现货价格-期货价格
</p>

<p>
*基差的不确定性被称为基差风险，降低基差风险实现套期保值关键是选择匹配度高的对冲期货合约。基差风险与对冲平仓时的基差直接相关，当投资者持有现货，持有期货短头寸对冲，对冲平仓日基差扩大，投资者将盈利；相反，当投资者未来将买入某项资产，持有期货长头寸对冲，对冲平仓日基差扩大，投资者将亏损。
</p>

<p>
*基差有时为正（此时称为反向市场），有时为负（此时称为正向市场），因此，基差是期货价格与现货价格之间实际运行变化的动态指标。
反向市场（又称逆向市场Inverted Market或现货溢价Backwardation）是指在特殊情况下，现货价格高于期货价格（或者近期月份合约价格高于远期月份合约价格），基差为正值。
出现这种情况有两个原因：一个对某种商品的需求非常迫切，远大于产量及库存量；二是预计将来该商品的供给会大幅度增加。
正向市场也叫正常市场，即在正常情况下，期货价格高于实货价格（或者合约价格低于远期月份合约价格），基差为负值。
正向市场分为两种情况，一是期货价格高于现货价格，二是远期合约价格高于近期合约价格。因为期货市场多了未来的持有成本，理论上期货价格应该高于现货价格，远期合约的价格也相应高于近期合约的价格。正向市场是套期保值交易的理想环境。
</p>

<p>
*套期保值指在期货市场上买入（或卖出）与现货市场交易方向相反、数量相等的同种商品的期货合约，进而无论现货供应市场价格怎样波动，最终都能取得在一个市场上亏损的同时在另一个市场盈利的结果，并且亏损额与盈利额大致相等，从而达到规避风险的目的。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-05-07 Sun 23:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
